Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: PUAN SEPERTI ITU…
en: power, you know?

source: LAKUKANNYA
en: from

source: Ehhh?
en: hey...

source: GLO
en: slam

source: MEMBAYARNYA..
en: he signed up for...

source: AH IYA...
en: oh?

source: ULAR
en: a familiar

source: YANG SATU INI
en: won’t budge

source: TERIMA KASIH, YA!
en: thank you!

source: UDAH
en: noon

source: SAAT CUTI, PUN..
en: even on his day off...

source: DEBAR KENCANG..
en: bursts...

source: AKU INGIN BOBOK DI TENDA SAMA KAKAK!!!!
en: we must sleep in the tent!!!

source: KOMPOR DI DAPUR
en: I already turned

source: LOKASI
en: the money

source: KIKKK..!!
en: eek!

source: PAKAI HEADSET
en: wearing earphones

source: PERJALANAN
en: it’ll take

source: WANJIR..
en: whoaa...

source: Apa itu??
en: what’s that?

source: NOMORNYA
en: did he

source: Maaf, ya!
en: I’m sorry!

source: A-APA?!
en: wh-what?!

source: Dan macan itu pun mundur perlahan..
en: then, the tiger slowly backed away.

source: JIKA KAMU MAU
en: if you want to end

source: Skskkskskskk...
en: tsk...

source: KARENA JATAH MAKANKU DIBATASI, INILAH SAATNYA UNTUK MENGEMBALIKAN OTOT-OTOTKU!
en: since I can’t eat as much as I used to, it’s time to build up my muscles again!

source: KOEN PIKIR
en: get up

source: TIDAK AKAN TER-
en: the resident

source: Kemana perginya jin monyet putih yang kuat dan arogan itu?
en: where is that cocky and powerful white monkey jinn I used to know?

source: MENEMUKAN JASAD
en: who found

source: APA-APA, KAN?
en: right?

source: SEMBARANGAN?
en: business”?

source: KEBETULAN
en: what a coincidence.

source: NGOMONG-NGOMONG,
en: by the way,

source: REPOT-REPOT MEN-
en: dig around for

source: KALIAN SUDAH
en: do you know

source: ..MBAK,
en: hey...

source: KODEKU KURANG
en: I need

source: AKU BARUSAN?
en: that dream about?

source: TERASA JANGGAL
en: I’ve ever had.

source: Warga sekitar yang segera mengetahui kecelakaan tersebut dapat menyelamatkan dua anak yang duduk di kursi belakang.."
en: “...two children in the back seat were saved by neighbors who heard about the accident right away and rushed to help...”

source: KAN!?!?
en: right?!

source: FYUUHH..!!
en: whoosh!

source: INI TERAKHIR!
en: it’ll be the last time.

source: G-GWAH!!
en: arghhh!

source: Gak perlu..
en: that should be enough.

source: KULIHAT SAJA BANYAK POHON STROBERI..!!
en: and what do I see, a field full of strawberry~

source: DEK RATNA..
en: ratna.

source: MELAKUKANNYA
en: would like

source: (TANGKAP SAJA AKU, TUAN SIMA!
en: (it’d be an honor to get caught by you,

source: BIARKAN SAYA BER-GABUNG DENGAN TIM SELANJUTNYA UNTUK TURUN KE LAPANGAN, PAK!!
en: Let me join in the search and help them find her, please.

source: AKU PUN BEGITU..
en: I’m with you there.

source: MEMBOHONGIKU..
en: messing around!

source: AKAN MENGHANCURKAN
en: you’ll end up killing

source: Aku sudah cukup muak meladeni kelakuan ajaibmu selama kau di sini..
en: my patience with your antics while you’re here has run thin...

source: *Nguping*
en: eavesdropping

source: PERGI JUGA, YA?
en: quite stubborn.

source: BUTUHKAN SESUATU
en: he still needs something

source: ..KIKK??
en: eek?

source: MATI BENERAN..
en: I had died for real!

source: DIA MERASA BER-
en: he felt

source: REPOT-REPOT SEMEDI
en: for 40 days

source: INI PASTI MIMPI..
en: I must be

source: ALATNYA,
en: purchased this,

source: ATAS HAL ITU..
en: for what happened to his workers.

source: Apakah tuan-tuan ini lagi marahan!?!
en: are you on bad terms with him, sir?!

source: Istriku itu dulu mantan preman SMA..
en: my wife was a thug in high school.

source: DASAR GAK MODAL!!
en: you damn cheapskates!

source: REPOT-REPOT
en: enticing him

source: UDAH ADA LIMA KUBURAN, LHO!
en: there have already been five graves!

source: JANGAN BERCANDA
en: stop playing around!

source: GOBLOK!!
en: you fool!!!

source: MANISMU!!
en: I’ll never trust you again!

source: ANDA TUJU SEDANG
en: you are calling

source: GWAH..!!
en: waaa!

source: TAPI BAWA KACAMATA CADANGAN, KAN, PASTI?
en: you brought the spare glasses, didn’t you?

source: KALAU KAMU MAU
en: if you're looking for

source: SEMALAM AKU TIDAK
en: I didn’t mean

source: Memangnya penghuni kamar itu mahluk apa, sih???
en: I’m curious, what kind of creature’s staying in that room?

source: Aku yakin kau akan jadi instruktur senam yang handal, Pita!
en: pita, I have no doubt that you’ll make an excellent instructor!

source: Istirahatlah dulu..
en: you should get some rest.

source: RATNA MASIH
en: ratna is

source: MULAI DARI
en: some of them

source: PUNYA WAKTU
en: got no time

source: ABANGKU ITU
en: well, yeah, my brother

source: Aku kenal seseorang dengan latar belakang it dan perdukunan yang bisa mewujudkan ide ini
en: I know a shamanic IT expert who can bring this concept to fruition.

source: YANG INGIN KUTAWAR-
en: with the job

source: HAPE INI..
en: this phone’s installment...

source: DARIMU, SIALAN!!
en: than you!

source: RUANGAN INI BER-
en: in this room

source: BEGINI SAJA TIDAK
en: handle a small project

source: LEPASKAN BINIKU, MBAH SURO!!!!
en: let go of her, master suro!!!

source: HEHEH…
en: hehehe...

source: TANGANKU--!!
en: my arm!

source: SESEMBAHANNYA
en: us to place

source: KAMU NGGAK
en: you’re

source: Lho??
en: what’s wrong?

source: TAPI LIHATLAH..
en: but look at us...

source: LAKUKAN SEMUA ITU
en: to get

source: AYAH BELUM SEMPAT
en: that we haven’t spent

source: KAN, SARIMIN..!!!
en: in the butt, sarimin!

source: TIDAK BISA MERASA-
en: can’t feel

source: *CELINGAK*
en: *look around*

source: SEUMUR HIDUPKU
en: defeated me.

source: MENGALAHKANMU!
en: all by myself!

source: INI, SEPERTI
en: just like

source: MENCARI BUDAKKU?!
en: of me?!

source: LEBIH BERTANGGUNG
en: mature

source: DI DALAM LUBANG
en: lying in

source: BUMI, YA?!
en: huh?!

source: Tidak masuk akal!!!
en: it doesn’t make any sense.

source: TIDAK MUNG-
en: no...

source: NGAPAIN DIA
en: why’s

source: Tapi biasanya jam segini kabutnya sudah tebal sekali, saya rasa lebih baik anda menunggu besok pagi saja untuk pulang..
en: ...but the fog is getting thicker now, so I think it’d be best for you to leave tomorrow morning.

source: TCH..
en: tsk...

source: Sa..
en: d-

source: SANG DETEKTIF (6)
en: the detective (6)

source: IBLIS BERWUJUD
en: in a man’s

source: GAWAT DIA PASTI
en: I think

source: MASIH..
en: do you

source: SEENAKNYA SAJA
en: you’ve got some nerves

source: DIA KALAU TAHU DIA
en: that he’d betray me,

source: AYO SINI,
en: come

source: KAKAK!
en: wait!

source: ZHAAA!
en: swoosh

source: UNTUK MELACAKMU!!
en: of course!

source: RUMAH TEMAN?
en: at your friend’s house.

source: HORROR BANGET SEPERTI DI FILM-FILM
en: like those in horror movies.

source: MENURUTMU SIAPA
en: who’s gonna

source: ..AWALNYA AKU
en: I thought

source: SECARA CUMA-CUMA?
en: for free?!

source: GYAAA… A… AH??
en: aaa... huh?

source: Yah, setidaknya aku dapat mainan baru..
en: well, at least... now I have this thing to keep me busy.

source: O..
en: w-wait...

source: …EH?!
en: huh?!

source: MASIH BELUM
en: see it

source: PARA PEKERJA
en: some of the workers

source: Tapi..
en: but...

source: Ayah...
en: dad...

source: I-ITU BUKAN
en: that’s

source: KOK DIEM AJA?
en: why are you so quiet?

source: DIA PERGI JAUH
en: still

source: MAKHLUK YANG
en: are really

source: ITU, DIT..
en: deserved, adit...

source: LAKUKAN..?!
en: are you doing?!

source: MONYET PUTIH?
en: monkey jinn?

source: PAKEEEETTT..!!
en: delivery service!

source: SAJA!!!!
en: something!

source: SOPAN, SEPERTINYA
en: I think

source: SIALAN..
en: shoot...

source: PUANMU?
en: all you’ve got?!

source: TIDUR DI KEBON GINI?
en: in a deserted field like this?

source: SAAT KAMI SALING
en: at each other

source: SUDAH DIMAAFKAN.
en: I’ve already forgiven you.

source: MINYA YANG SEMPAT
en: old

source: MENJADI PRIA YANG
en: more

source: Mengembangkan aplikasi ghoib untuk terhubung dengan klien-klien ku!!
en: to create an underworld app that will allow me to connect with my clients!

source: SANG DETEKTIF
en: the detective

source: PUNYA MASALAH?
en: HAVE YOU ENCOUNTERED A PROBLEM?

source: HADIRI PEMAKAMAN
en: to his funeral

source: AKUUUU…!!!!
en: leave me here!!!

source: Ma..
en: please...

source: SATU KORBAN
en: one

source: Sekarang dia tanpa rasa malu menyantap sesaji yang dipersembahkan untuk jin lain..
en: last time I checked, he wouldn’t eat up the offerings of other jinns.

source: Lho?
en: huh?

source: KELIHATAN ANGKER..
en: seems haunted...

source: BERAPA, MAS?
en: getting off?

source: SEKALI!
en: a drag...

source: AKU TAHU KAU
en: I know

source: SESEMBAHAN?
en: some offerings!

source: KASURKU….
en: oh, my bed...

source: AAAAAAA!!!!!
en: arghhhhh!!!

source: MAIN..!!
en: around!

source: BILANG KALAU DIA MAU
en: to take

source: SAHABAT LAMA SUA-
en: as his

source: KASIHAN SEKALI..
en: poor man...

source: SESOSOK PRIA BERTOPENG
en: wearing

source: Itu kan..
en: hm? isn’t that...

source: BISA KITA LAKUKAN
en: gotta be something

source: MELAKUKAN PERJANJIAN
en: made a bargain

source: KAMI MENEMUKAN
en: we found

source: KALAU KAMU
en: I couldn’t bear

source: Ehem..
en: ahem...

source: HMPH,
en: tsk...

source: LAKUKAN
en: do something,

source: N...
en: o-

source: KOK PERASAANKU
en: I have a bad feeling

source: SIALAN..!!
en: you bastard...

source: MENGULUR-ULUR
en: just to waste

source: Ya, yaa??
en: okay?

source: MEREKA SENDIRI..
en: what he wants.

source: JANGAN DIJADIKAN KONTEN, MAHHH!!!
en: don’t share it on social media, honey!

source: Kavling tiga!!!
en: post number three!

source: MACAM APA
en: this

source: DIRAWAT DI RS ITU?
en: at the hospital?

source: APA YANG HARUS KU-LAKUKAN KALAU BEGINI!?
en: jump down the cliff and get it?!

source: RAMBUT KOTORMU
en: with that

source: HARTA ORANG LAIN
en: money

source: TERGODA DENGAN
en: easily swayed

source: Ini saatnya kau balas budi
en: It’s time for you to return the favor.

source: MENGURUSNYA!
en: handle it!

source: MERASAKAN
en: feel

source: TEMPAT MBAH DAMAR
en: mr. damar’s place

source: BANGUN!!
en: jolt

source: Wah, indahnya!
en: so beautiful!

source: A-AKU TAKUT…!!
en: I’m too scared!!!

source: EWWH..
en: ew...

source: BELUM NGOMONG
en: even said

source: PUR!!
en: purnomo!

source: AKU BAKAL
en: that

source: AYAH, AKU PERCAYA
en: to.

source: KERUSAKAN YANG KALIAN
en: has been the culprit

source: HANDPHONE ITU BERISI KONTAK-KONTAK PENTING UNTUK PEKERJAAN AYAH!!
en: that phone had a lot of important contacts for my office work!!!

source: NGGHH..
en: ughhh...

source: TAPI 'SESUATU'!!
en: but “something.”

source: PAK JUNAEDI
en: mr. junaedi

source: WAH, MAMAH KOK KEPIKIRAN, SIH?!
en: wow, you’re so handy, honey!

source: Episode 6
en: episode 7

source: CERITA MISTIS LAGI
en: talk about the supernaturals

source: Terimakasih atas kesempatan yang diberikan kepada saya selaku CEO dari PT Cepat tepat laknat--
en: Thank you for giving me the opportunity to present as the CEO of the fastest way to get doomed limited--

source: MEMELIHARANYA
en: to be

source: MENYANGKA ORANG
en: can’t believe

source: DARI HIDUPKU
en: for

source: DI SINI HUTAN SEMUA, KAK,, JANGAN ASAL NGELIATIN ATAU NUNJUK-NUNJUK TEMPAT SEM-BARANGAN!
en: this area is surrounded by forests, so stop pointing and looking at creepy places!

source: MENDAPAT KARMA-
en: you’ll get

source: KENAPA?!
en: me?!

source: ZRAAAA
en: swoosh

source: Jangan lupa dengan siapa kau bicara, Sima..
en: what do you take me for?

source: KUBERI TAHU
en: let me tell you

source: AKAN-
en: will--

source: AYAH MASIH
en: I’ve got to get back

source: Kulihat saja..
en: and what do I see~?

source: WAH, GAWAT..
en: oh, no...

source: ACK!!
en: hey!

source: KAMU TIDAK MENGHARGAI PRIVASI ORANG LAIN, YA?!
en: have some manners!

source: PERMISI,
en: hello,

source: PERMINTAAN ANDA
en: what an

source: BEKERJA
en: to work.

source: SUDAH SAYA PERINGATKAN LHO, PAK..
en: I told you.

source: ADA APA,
en: what’s the matter,

source: SIAPA BOSS-NYA
en: who’s

source: INGIN UANGKU
en: my money

source: DAN YANG
en: but,

source: WOW!!
en: whoa!

source: JENAZAHNYA UNTUK
en: for

source: JADI SALAH SATU
en: I’ll be

source: MAKAMAN WASA
en: wasa’s funeral

source: TODAL TAHU DIRI!!
en: vile humans!

source: Syap!
en: yessir!

source: Apa?!
en: what?!

source: SAKIT SEKALI!!
en: it really hurts!

source: Temukan mereka sebelum matahari terbit!!
en: get them before the sun rises!

source: Masalahnya adalah, aku membutuhkan perantara untuk menghubungkan energiku dengan mereka
en: the issue is that I require an intermediary to connect my energy to their souls.

source: SAMPAI DI SINI SAJA..
en: ends here,

source: TIDAK CINTA
en: and doesn’t care about

source: Tapi tetap saja!!
en: but still!

source: JADI SIAPA YANG
en: look who’s

source: TCH, DASAR..
en: tsk, damn parasites...

source: PAKAI MOBIL
en: you can

source: NAMUN MIMPI YANG
en: however, what follow is

source: Ig : @sariminsaja
en: instagram: @sariminsaja

source: TERLANJUR PERCAYA
en: fully put your trust

source: Makin banyak kebijakan yang memberatkan jin-jin menengah sepertiku..
en: middle-class jinns like me are being squeezed by an increasing number of regulations.

source: LOH?!
en: what the-?

source: TAN!
en: in pain!

source: KAU LAKUKAN..
en: you can do

source: ..KAU SUDAH
en: you’ve accepted

source: DENGAR ATAU ME-
en: or see

source: SEJAK 'KECELAKAAN'
en: ever since

source: KENAPA TIBA-
en: what does

source: Tuan Sarimin!!
en: mr. sarimin!

source: BO..
en: th-

source: BLAR-BLER
en: more variety

source: DI LUAR!!
en: waiting!

source: SELANJUTNYA!!
en: the same fate!

source: K..KIKK??
en: e-eek?

source: UNTUK MENJAGA
en: to defend

source: PERCAYA JUGA??
en: now?

source: DUKUN YANG LEBIH
en: the strongest shaman

source: ADA KITA BERDUA, NIH..
en: we’re the only ones here,

source: AKU AWET
en: I’ve been

source: NYET..?!
en: you’re going?!

source: YASUDAH YAH POKOKNYA NGGAK PERLU TERIAK-TERIAK LAGI-- DILIHATIN BANYAK ORANG!
en: okay, stop shouting. everyone is looking at us!

source: BIASANYA
en: you know,

source: BERMAKSUD MENINGGAL-
en: to leave you behind

source: HOI,
en: hey,

source: MAMPU UNTUK MERAIH
en: not afraid

source: OOSH
en: (redacted)

source: Sepertinya kamu kelelahan karena perjalanan jauh dan jatuh pingsan..
en: I think you were tired from the long trip, so you passed out.

source: MERIBUTKAN HAL-
en: talking about

source: YA KURANG LAH,
en: of course it wasn’t,

source: MUNGKIN BISA MEM-
en: that some guys

source: DIA?!?!
en: the hell?!

source: PARA PEKERJA YANG
en: to your workers.

source: SAMPAI BISA
en: whoa...

source: TUNJUKKAN SIAPA
en: show him

source: KEKUATAN JIN BULUS
en: who borrowed

source: KAN NGGAK SENGAJA!
en: she didn’t mean to.

source: EEWHH!!!!
en: ew!

source: DUGAANKU
en: I was

source: KALAU SAJA
en: if only

source: MUKA MARAHNYA
en: she’s so ugly

source: LOH, KAMU DIMANA, SEYENG?
en: wait, where are you, honey?

source: SEDANG ADA
en: obviously busy

source: NGGAK USAH TERLALU SEMANGAT!!
en: don’t be too excited!

source: SEGINI SAJA KEMAM-
en: is that

source: TAK!
en: (redacted)

source: DEK!!
en: hey!

source: ITU!?!?
en: Jimbung?!

source: MODE 'HENING' JADI
en: “silent mode.”

source: TUJUH RUPA YANG
en: mixed with seven kinds of flower petals

source: MAMAH GAK KUAT NYUSUL..
en: I couldn’t keep up...

source: BERI GERTAKAN
en: I’ll just give them

source: NGECEK HP LAGI..
en: he’s checking his phone again.

source: YA??
en: sooner.

source: KAN!??!
en: isn’t she?!

source: MALAH TIDAK BER-
en: isn’t

source: TELAH MEMOTIVASIKU!
en: my biggest motivation since our last fight!

source: Ternyata lagi bobok syantiq toh..
en: oh, he’s sleeping soundly.

source: MENULISKANNYA DI
en: you write your response

source: B-BABI BAKAR..!!
en: a roasted boar!

source: T...
en: s...

source: BERIKAN DOKUMEN
en: give her

source: PERNAH KELIHATAN
en: I’d never seen him

source: BARU SETENGAH
en: it’s only been

source: BUKAN TAJIR
en: I’m

source: PENUNGGU DARI SINI,
en: a jinn’s doing,

source: DA!
en: (redacted)

source: HARUSNYA JIN MONYET
en: I thought

source: KALIAN MENYESAL
en: make you regret what you’ve done

source: BANGET!!
en: my luck!

source: KALIAN PACARAN
en: all lovey-dovey,

source: KALI INI BUKANLAH
en: that we’ve invited

source: ..TIDAK SEPERTI SAYA DULU..
en: so that they won’t end up like me...

source: ..DIMANA KACAMATAKU!?
en: where are my glasses?!

source: JANGAN BILANG
en: don’t say anything

source: Lagipula bapak dan ibu pasti sekarang sangat lelah, kan?
en: also, you must be tired right now.

source: KAKI??
en: for this?

source: SALAHANKU DULU
en: since then.

source: SUDAH MENUNGGU
en: you’ve been

source: BEBERAPA HARI
en: that a few days

source: DULU, DEH!
en: a warning first.

source: Ada longsor di depan, pak..
en: there is a landslide up ahead,

source: AKU HARUS ME-
en: it has

source: SI MAS..
en: only the two of us.

source: BACOT LAGI, AKAN
en: empty promises,

source: BIAR AYAH AJA YANG NYETIR, DEH!!!
en: just let me drive!

source: Tujuan..?
en: destination?

source: ..EMANGNYA
en: they’re acting

source: BUANG WAKTU
en: any more

source: PAK GUNAWAN..
en: mr. gunawan.

source: MENGAJAKMU JALAN-
en: much time together

source: PERGHOIBAN
en: of the supernaturals!

source: YANG SATU INI MASIH
en: needs some

source: YANG BARU SAJA
en: if they heard

source: DILIHATIN REKAN-
en: people

source: ..APAANSI?!
en: what’s up with him?!

source: SASI, MAKA AKU AKAN
en: well, I’ll

source: Kamar ini ya..!
en: this is the room!

source: GITU, KOK…
en: “master”?

source: Aku saja yang mengambil barang di tenda
en: just stay here and let me do it.

source: SIALAN--
en: you bastard...

source: INI SEMUA BUKAN
en: you’re not completely

source: MAU KE MANA?
en: where to?

source: MAKHLUK YANG HIDUP
en: who inhabit this world.

source: SAYA..
en: so...
